# Дано положительное действительное число X. Выведите его дробную часть.
num = float(input())
print(round(num - int(num), 6))
